{
  "id": "ch1_the_inquisitor",
  "chapter": "chapter1",
  "title": "Inquisitor Voss",
  "conditions": {
    "requiredFlags": ["ch1_fortress_seen"],
    "forbiddenFlags": ["ch1_inquisitor_seen"]
  },
  "blocks": [
    {
      "type": "description",
      "text": "The office is austere. No trophies on the walls. No banners. No skulls mounted on pikes. Just data-slates stacked in precise columns, a single high-backed chair behind a desk of polished metal, and the persistent hum of psy-dampeners embedded in the walls."
    },
    {
      "type": "description",
      "text": "Inquisitor Mordecai Voss is not what you expected. He is thin — almost gaunt — with silver hair cropped close and a face that speaks of decades of service in the God-Emperor's darkest work. His eyes are the color of spent ammunition casings, and they fix on you with the intensity of an orbital lance."
    },
    {
      "type": "description",
      "text": "A servo-skull hovers at his shoulder — brass and bone, augmetic eye glowing a steady red. It rotates to face you as you enter, and you feel the faint whir of a recording device activating. Everything said in this room will be documented."
    },
    {
      "type": "description",
      "text": "Voss glances at a data-slate on his desk — the Storm Trooper Sergeant's report, you realize. A faint nod. 'The sergeant noted your composure under observation. Good. I have no use for psykers who crack under scrutiny.'",
      "requiredFlags": ["guards_impressed"],
      "speaker": ""
    },
    {
      "type": "description",
      "text": "Voss's eyes narrow as he reads the Storm Trooper's report. 'The guards reported you attempted composure but your hands betrayed you. Fear is natural, psyker. Lying about it is not.' His tone is cold. 'I need assets who know their limits, not ones who pretend they have none.'",
      "requiredFlags": ["fear_showed"],
      "speaker": ""
    },
    {
      "type": "description",
      "text": "The data-slate in Voss's hand shows a red flag — the Storm Troopers' report is dismissive. 'The sergeant noted... hesitation. Uncertainty. The guards smirked when you passed.' Voss sets the slate down with deliberate care. 'First impressions matter in this line of work. You failed yours.'",
      "requiredFlags": ["guards_smirked"],
      "speaker": ""
    },
    {
      "type": "description",
      "text": "Voss taps a data-slate, his expression unreadable. 'You kept your head down at the gate. Wise. Or cowardly. We'll see which.' His tone suggests he considers you an obedient tool — nothing more.",
      "requiredFlags": ["kept_low", "survival_instinct"],
      "speaker": ""
    },
    {
      "type": "description",
      "text": "Voss's eyes narrow as he reviews a data-slate. 'The psy-sensors detected your probing at the fortress perimeter. Clever work — the wards are calibrated to Alpha-grade threats, not passive analysis.' A pause. 'But curiosity is a dangerous trait in your profession.'",
      "requiredFlags": ["tested_wards", "ward_weakness_found"],
      "speaker": ""
    },
    {
      "type": "description",
      "text": "Voss glances at a red-flagged report. 'You triggered ward alarm Beta-Seven when you arrived. Clumsy. The wards are there for your protection as much as ours. Remember that.' His tone is cold, warning.",
      "requiredFlags": ["wards_bit_back"],
      "speaker": ""
    },
    {
      "type": "description",
      "text": "Voss's expression is glacial as he taps a priority alert on his data-slate. 'The psy-sensors recorded your failed probing at the perimeter. You touched the wards and they burned you.' He leans forward slightly. 'Worse — you left a psychic signature doing it. Sloppy. The wards are calibrated to detect exactly this kind of amateurish intrusion.'",
      "requiredFlags": ["psychic_feedback_burn"],
      "speaker": ""
    },
    {
      "type": "description",
      "text": "Voss's gaze lingers on you with something that might be approval. 'I am told you prayed at the gate. Faith is the shield of the righteous, even for one cursed with your gifts. The Emperor protects those who remember their duty.'",
      "requiredFlags": ["prayed_at_fortress"],
      "speaker": ""
    },
    {
      "type": "description",
      "text": "There's a notation on the data-slate that catches your eye — a flag from Interrogator Lira's initial report. 'You attempted to refuse the summons,' Voss says quietly. 'I respect defiance when it stems from principle. But defiance without discipline is merely rebellion. Which are you, psyker?'",
      "requiredFlags": ["defiant_nature"],
      "speaker": ""
    },
    {
      "type": "dialogue",
      "text": "Sit.",
      "speaker": "Inquisitor Voss",
      "speakerMood": "commanding"
    },
    {
      "type": "description",
      "text": "There is only one other chair in the room. It faces the desk, positioned precisely so that the lumen-strip above casts light directly into the seated person's eyes. This is not an office — it is an interrogation room dressed in politeness."
    },
    {
      "type": "description",
      "text": "Voss leans back slightly, studying you. 'Lira's report mentions you used your gifts in your hab-unit — before you even knew you were being summoned. Either you have good instincts, or you're dangerously reckless with your powers. I suspect it's both.'",
      "requiredFlags": ["psychic_sense_used"],
      "speaker": ""
    },
    {
      "type": "dialogue",
      "text": "I will be direct with you, psyker, because I find that the gifted respond poorly to obfuscation. Your kind sense dishonesty the way a bloodhound scents prey. So. The truth.",
      "speaker": "Inquisitor Voss",
      "speakerMood": "calculating"
    },
    {
      "type": "dialogue",
      "text": "Something is rotting in the underhive. A cult — we believe they style themselves 'The Whispering Choir' — has been conducting rituals that are destabilizing the local psychic environment. Three astropaths in this sector have suffered spontaneous hemorrhaging. Two are dead. The Astronomican signal has degraded 0.3 percent in local space. That may sound trivial. It is not.",
      "speaker": "Inquisitor Voss",
      "speakerMood": "grave"
    },
    {
      "type": "dialogue",
      "text": "I need a sanctioned psyker who can trace the psychic resonance of their rituals. Someone who can walk into that underhive, feel the currents of the Warp, and find me the source. That is you.",
      "speaker": "Inquisitor Voss",
      "speakerMood": "intense"
    },
    {
      "type": "description",
      "text": "He pauses. The servo-skull — Macharius, according to the nameplate on its brass jaw — whirs softly."
    },
    {
      "type": "dialogue",
      "text": "You should know: two previous assets were sent. Neither returned. One was found three days later, skinned and displayed in the Processional of the Blessed. The other... was simply gone. As if they had never existed.",
      "speaker": "Inquisitor Voss",
      "speakerMood": "cold"
    }
  ],
  "choices": [
    {
      "id": "accept_duty",
      "text": "\"I serve the Emperor and His Inquisition. I accept this duty.\"",
      "visibleWhenLocked": false,
      "effects": {
        "setFlags": ["accepted_duty", "loyal_servant"],
        "factionRepChanges": { "inquisition": 10 },
        "npcRelationshipChanges": {
          "inquisitor_voss": { "respect": 10, "loyalty": 5 },
          "interrogator_lira": { "respect": 5 }
        },
        "xpGain": 10,
        "nextScene": "ch1_the_briefing"
      }
    },
    {
      "id": "ask_about_dead",
      "text": "\"The previous assets — what were their capabilities? How did they fail?\"",
      "visibleWhenLocked": false,
      "skillCheck": {
        "stat": "intelligence",
        "difficulty": -25,
        "successScene": "ch1_the_briefing",
        "failureScene": "ch1_the_briefing"
      },
      "effects": {
        "setFlags": ["asked_about_dead_assets", "tactical_thinker"],
        "successFlags": ["knows_dead_asset_details", "knows_first_was_telepath", "deduced_cult_countermeasures"],
        "failureFlags": ["vague_intel_only", "voss_withheld_details"],
        "npcRelationshipChanges": {
          "inquisitor_voss": { "respect": 10, "knowledge": 10 }
        },
        "xpGain": 15,
        "nextScene": "ch1_the_briefing"
      }
    },
    {
      "id": "demand_compensation",
      "text": "\"Two dead assets suggests inadequate support. I will need proper resources and compensation.\"",
      "visibleWhenLocked": true,
      "conditions": {
        "minStat": { "fellowship": 25 }
      },
      "lockReason": "Requires Fellowship 25+",
      "effects": {
        "setFlags": ["demanded_compensation", "mercenary_streak"],
        "npcRelationshipChanges": {
          "inquisitor_voss": { "respect": -5, "affinity": -10 }
        },
        "throneChange": 100,
        "factionRepChanges": { "inquisition": -5 },
        "xpGain": 10,
        "nextScene": "ch1_the_briefing"
      }
    },
    {
      "id": "read_mind",
      "text": "[PSYCHIC] Reach into his mind. Find out what he isn't telling you.",
      "visibleWhenLocked": true,
      "conditions": {
        "minStat": { "willpower": 40 }
      },
      "lockReason": "Requires Willpower 40+",
      "skillCheck": {
        "stat": "willpower",
        "difficulty": 10,
        "successScene": "ch1_read_mind_success",
        "failureScene": "ch1_read_mind_failure"
      },
      "effects": {
        "setFlags": ["attempted_mind_reading_voss"],
        "corruptionChange": 3,
        "sanityChange": -2,
        "xpGain": 30,
        "nextScene": "ch1_the_briefing"
      }
    }
  ],
  "onEnterEffects": {
    "setFlags": ["ch1_inquisitor_seen", "met_inquisitor_voss"]
  },
  "isHub": false,
  "tags": ["inquisition", "npc_introduction", "dialogue", "mission", "grimdark"],
  "location": "inquisitorial_fortress"
}
