{
  "id": "ch1_the_briefing",
  "chapter": "chapter1",
  "title": "The Whisper in the Dark",
  "conditions": {
    "requiredFlags": ["ch1_inquisitor_seen"],
    "forbiddenFlags": ["ch1_briefing_seen"]
  },
  "blocks": [
    {
      "type": "description",
      "text": "Voss's tone is noticeably more curt than before. He activates the holo-projector with sharp, precise movements. 'You demanded compensation. Very well. You'll receive your thrones — if you survive.' The transactional nature of your relationship is now clear.",
      "requiredFlags": ["demanded_compensation"],
      "speaker": ""
    },
    {
      "type": "description",
      "text": "There's a subtle shift in Voss's demeanor — less guarded, more collaborative. 'You asked intelligent questions. That tells me you can analyze threats, not just react to them.' He activates the holo-projector with deliberate care, pointing to specific details.",
      "requiredFlags": ["knows_dead_asset_details"],
      "speaker": ""
    },
    {
      "type": "description",
      "text": "Voss activates the holo-projector, but his briefing feels deliberately incomplete. When you asked about the previous assets, he deflected — gave you generalities instead of tactical specifics. Important details are clearly being withheld. You notice gaps in the intel: no mention of how the first asset was tracked, no explanation for the second's disappearance. The pieces don't fit together.",
      "requiredFlags": ["vague_intel_only"],
      "speaker": ""
    },
    {
      "type": "description",
      "text": "As Voss speaks, you catch the faintest flicker of something in his psychic presence — something you glimpsed when you probed his mind. The way he refers to 'assets' and 'tools' carries a different weight now. You know his secret fear: that psykers like you will turn, corrupted by the very powers you wield. He watches you with the vigilance of a man who expects betrayal.",
      "requiredFlags": ["voss_secret_known", "knows_psyker_turning"],
      "speaker": ""
    },
    {
      "type": "description",
      "text": "The servo-skull Macharius hovers closer to you than before, its augmetic eye tracking your every micro-expression. Voss detected your mental probe earlier, and now every word he speaks feels measured, tested. You are no longer just an asset — you are a potential threat under observation.",
      "requiredFlags": ["voss_detected_probe"],
      "speaker": ""
    },
    {
      "type": "description",
      "text": "Voss's tone throughout the briefing is pointed, almost threatening. The servo-skull Macharius hovers uncomfortably close, its recording lens focused on you with unblinking intensity. 'Trust is earned in the Inquisition,' Voss says quietly, his eyes never leaving you. 'You have already spent some of yours.'",
      "requiredFlags": ["voss_distrusts_you"],
      "speaker": ""
    },
    {
      "type": "description",
      "text": "Voss's voice carries a note of trust — rare from an Inquisitor addressing a psyker. 'You accepted this duty without hesitation. That loyalty will be remembered.' He activates the holo-projector, his movements less guarded than they might otherwise be.",
      "requiredFlags": ["loyal_servant"],
      "speaker": ""
    },
    {
      "type": "description",
      "text": "Voss activates a holo-projector. The air above his desk shimmers and resolves into a three-dimensional map of Hive Tertium's lower levels — a tangled nightmare of collapsed tunnels, abandoned manufactory blocks, and fungal growth zones that haven't seen daylight in centuries."
    },
    {
      "type": "dialogue",
      "text": "The cult's activity is centered here — Subsector Morwen-9, in the deep underhive. A former Ecclesiarchy chapel complex, abandoned after the Sector Plague of 803.M41. The area is now controlled by competing ganger factions, mutant clans, and whatever else festers in the dark.",
      "speaker": "Inquisitor Voss",
      "speakerMood": "professional"
    },
    {
      "type": "description",
      "text": "Red markers pulse on the holo-map. Each one represents a psychic disturbance — a spike in Warp energy recorded by the sector's detection equipment. They form a pattern, you notice. Not random. A spiral, tightening inward toward a single point."
    },
    {
      "type": "dialogue",
      "text": "Interrogator Castiel will serve as your handler and field commander. Throne Agent Drax provides operational security. Magos Rhyn-7 is tasked with cataloguing any archeotech or heretical artifacts recovered. And you... you are the blade I am pointing at the enemy's throat.",
      "speaker": "Inquisitor Voss",
      "speakerMood": "cold"
    },
    {
      "type": "dialogue",
      "text": "The servo-skull Macharius will accompany you. Consider it my eyes. And my judgment.",
      "speaker": "Inquisitor Voss",
      "speakerMood": "warning"
    },
    {
      "type": "description",
      "text": "You notice Macharius's optical lens focuses on you with particular intensity when Voss mentions the cult. Given what you learned from probing Voss's mind — his fear of psyker corruption — you understand now: the servo-skull isn't just recording your actions. It's watching for signs of taint.",
      "requiredFlags": ["voss_secret_known"],
      "speaker": ""
    },
    {
      "type": "system_message",
      "text": "[SYSTEM] Quest Available: 'The Whisper in the Dark' — Investigate the Whispering Choir cult in the underhive of Hive Tertium."
    },
    {
      "type": "dialogue",
      "text": "Before you are deployed, I want you tested. Astropath Seren will evaluate your psychic stability in the Sanctum. I need to know what you are capable of — and what you might become.",
      "speaker": "Inquisitor Voss",
      "speakerMood": "appraising"
    }
  ],
  "choices": [
    {
      "id": "ask_intel",
      "text": "\"What do we know about the cult's leadership? Their numbers? Their doctrine?\"",
      "visibleWhenLocked": false,
      "skillCheck": {
        "stat": "intelligence",
        "difficulty": -30,
        "successScene": "ch1_the_sanctum",
        "failureScene": "ch1_the_sanctum"
      },
      "effects": {
        "setFlags": ["asked_cult_intel", "tactical_thinker"],
        "successFlags": ["cult_intel_detailed", "knows_choir_structure", "knows_ritual_pattern"],
        "failureFlags": ["cult_intel_basic", "voss_evasive_on_details"],
        "npcRelationshipChanges": {
          "inquisitor_voss": { "respect": 5, "knowledge": 5 }
        },
        "xpGain": 15,
        "startQuest": "whisper_in_the_dark",
        "nextScene": "ch1_the_sanctum"
      }
    },
    {
      "id": "ask_support",
      "text": "\"Will we have extraction support? Medical? Reinforcements if things go wrong?\"",
      "visibleWhenLocked": false,
      "effects": {
        "setFlags": ["asked_about_support", "pragmatic_approach"],
        "npcRelationshipChanges": {
          "inquisitor_voss": { "knowledge": 5 },
          "agent_drax": { "respect": 5 }
        },
        "xpGain": 10,
        "startQuest": "whisper_in_the_dark",
        "nextScene": "ch1_the_sanctum"
      }
    },
    {
      "id": "ask_gangers",
      "text": "\"The ganger factions — can any be leveraged? An enemy of my enemy...\"",
      "visibleWhenLocked": true,
      "conditions": {
        "minStat": { "intelligence": 30 }
      },
      "lockReason": "Requires Intelligence 30+",
      "effects": {
        "setFlags": ["asked_about_gangers", "political_mind", "knows_iron_serpents"],
        "npcRelationshipChanges": {
          "inquisitor_voss": { "respect": 10 }
        },
        "xpGain": 20,
        "startQuest": "whisper_in_the_dark",
        "nextScene": "ch1_the_sanctum"
      }
    },
    {
      "id": "accept_silently",
      "text": "Nod. You have the mission parameters. Words are a luxury in the Inquisition's service.",
      "visibleWhenLocked": false,
      "effects": {
        "setFlags": ["stoic_acceptance"],
        "factionRepChanges": { "inquisition": 5 },
        "xpGain": 5,
        "startQuest": "whisper_in_the_dark",
        "nextScene": "ch1_the_sanctum"
      }
    }
  ],
  "onEnterEffects": {
    "setFlags": ["ch1_briefing_seen"],
    "xpGain": 10
  },
  "isHub": false,
  "tags": ["inquisition", "briefing", "mission", "quest_start", "cult"],
  "location": "briefing_chamber"
}
